docs/concept/concept.md
``` mermaid
classDiagram
    direction RL
    class Concept {
        - type : ConceptType
    }
    class UseCase {
        - vocabulary: Vocabulary
        - stories: Story[]
    }
    link UseCase "../use-case/"
    UseCase --> UseCase : requires
    Vocabulary "*" --> "*" Concept
    Vocabulary "*" --> "*" Term
    Story --> "*" Concept : input
    Story --> "*" Concept : output
    Term --> "1..*" Concept
    %% Concept --> OntologyAxiom
    Vocabulary <--> Concept
    UseCase --> "1..*" Story
    Persona --|> Concept
    Concept --> Concept : broader
    Concept --> Term : preferred
    UseCase --> "1" Vocabulary : use case vocabulary
```
